<template>
    <ApprovalList :buttons="buttons" :columnDefs="columnDefs" :rowData="rowData"
    @button-click="linkButton" />
</template>
  
  <script>
  import ApprovalList from '@/components/PaymentLayout/ApprovalList.vue'
  
  export default {
    components: { ApprovalList },
    methods:{
      linkButton(action){
        window.location.href = action;
      }
    },
    data() {
      return {
        buttons: [
          { label: '기안', class: 'btn-primary', action: 'http://localhost:8077/RegisterTest'},
          { label: '공람발송', class: 'btn-warning' },
          { label: '인쇄/다운로드', class: 'btn-excel' }
        ],
        columnDefs: [
          { header: '문서번호', name: '문서번호' },
          { header: '현재결재상태', name: '현재결재상태' },
          { header: '종류', name: '종류' },
          { header: '양식', name: '양식' },
          { header: '제목', name: '제목' },
          { header: '기안부서', name: '기안부서' },
          { header: '기안자', name: '기안자' },
          { header: '기안일시', name: '기안일시' }
        ],
        rowData: [
          { 문서번호: '총무-2025', 현재결재상태: '승인', 종류: '일반결재', 양식: '구입신청서', 제목: '1', 기안부서: '총무팀', 기안자: '홍길동', 기안일시: '2025-02-03' }
          ,{ 문서번호: '총무-2025', 현재결재상태: '승인', 종류: '일반결재', 양식: '구입신청서', 제목: '2', 기안부서: '총무팀', 기안자: '홍길동', 기안일시: '2025-02-03' }
          ,{ 문서번호: '총무-2025', 현재결재상태: '승인', 종류: '일반결재', 양식: '구입신청서', 제목: '3', 기안부서: '총무팀', 기안자: '홍길동', 기안일시: '2025-02-03' }
          ,{ 문서번호: '총무-2025', 현재결재상태: '승인', 종류: '일반결재', 양식: '구입신청서', 제목: '4', 기안부서: '총무팀', 기안자: '홍길동', 기안일시: '2025-02-03' }
          ,{ 문서번호: '총무-2025', 현재결재상태: '승인', 종류: '일반결재', 양식: '구입신청서', 제목: '5', 기안부서: '총무팀', 기안자: '홍길동', 기안일시: '2025-02-03' }
          ,{ 문서번호: '총무-2025', 현재결재상태: '승인', 종류: '일반결재', 양식: '구입신청서', 제목: '6', 기안부서: '총무팀', 기안자: '홍길동', 기안일시: '2025-02-03' }
          ,{ 문서번호: '총무-2025', 현재결재상태: '승인', 종류: '일반결재', 양식: '구입신청서', 제목: '7', 기안부서: '총무팀', 기안자: '홍길동', 기안일시: '2025-02-03' }
          ,{ 문서번호: '총무-2025', 현재결재상태: '승인', 종류: '일반결재', 양식: '구입신청서', 제목: '8', 기안부서: '총무팀', 기안자: '홍길동', 기안일시: '2025-02-03' }
          ,{ 문서번호: '총무-2025', 현재결재상태: '승인', 종류: '일반결재', 양식: '구입신청서', 제목: '9', 기안부서: '총무팀', 기안자: '홍길동', 기안일시: '2025-02-03' }
          ,{ 문서번호: '총무-2025', 현재결재상태: '승인', 종류: '일반결재', 양식: '구입신청서', 제목: '10', 기안부서: '총무팀', 기안자: '홍길동', 기안일시: '2025-02-03' }
          ,{ 문서번호: '총무-2025', 현재결재상태: '승인', 종류: '일반결재', 양식: '구입신청서', 제목: '11', 기안부서: '총무팀', 기안자: '홍길동', 기안일시: '2025-02-03' }
          ,{ 문서번호: '총무-2025', 현재결재상태: '승인', 종류: '일반결재', 양식: '구입신청서', 제목: '12', 기안부서: '총무팀', 기안자: '홍길동', 기안일시: '2025-02-03' }
          ,{ 문서번호: '총무-2025', 현재결재상태: '승인', 종류: '일반결재', 양식: '구입신청서', 제목: '13', 기안부서: '총무팀', 기안자: '홍길동', 기안일시: '2025-02-03' }
          ,{ 문서번호: '총무-2025', 현재결재상태: '승인', 종류: '일반결재', 양식: '구입신청서', 제목: '14', 기안부서: '총무팀', 기안자: '홍길동', 기안일시: '2025-02-03' }

        ]
      }
    }
  }
  </script>
  